k1ln/synth-32/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# Required for MIPI DSI DPI panel (esp_lcd_new_panel_dpi) on IDF v5.x ESP32-P4
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# PSRAM — required for MIPI DSI frame buffers (720x1280 RGB565 x3 = 5.25 MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# Chip revision — board has ESP32-P4 v1.3 silicon
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Main task runs the boot song_load, which preloads drum WAVs into PSRAM. That
# path uses >3 KB of stack (native[] resample scratch + read buffers), so the
# 3584-byte default overflows. Match the HTTP/UI tasks that also run preloads.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Display — 5-inch 720x1280 (HX8394, MIPI-DSI), double-buffered for flicker-free updates
CONFIG_BSP_LCD_TYPE_720_1280_5_INCH_A=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2

# ESP-Hosted: WiFi via ESP32-C6 coprocessor over SDIO
# Disable mempool — pre-allocation of DMA-aligned pool fails on P4 v1.3 silicon
CONFIG_ESP_HOSTED_USE_MEMPOOL=n
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=20000

# esp_wifi_remote — route WiFi API through esp_hosted
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32
CONFIG_WIFI_RMT_TX_BUFFER_TYPE=1
CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUF=0
CONFIG_WIFI_RMT_ESPNOW_MAX_ENCRYPT_NUM=7

# LwIP tuning
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y

# Bluetooth off (C6 handles WiFi only)
CONFIG_BT_ENABLED=n

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_WS_SUPPORT=y

# Task watchdog — PSRAM framebuffer writes are slow enough to starve IDLE0.
# Don't monitor IDLE tasks; the ui task itself won't deadlock.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

# Logging — keep WARN only; INFO/DEBUG from audio + stream tasks adds UART latency
CONFIG_LOG_DEFAULT_LEVEL_INFO=n
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

# Flash — 8 MB
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# FATFS — SD cards are formatted with 512-byte sectors. The default 4096-byte
# FATFS sector size causes mount to succeed but all writes return EACCES
# (errno 13), making mkdir/fopen-write silently fail.
CONFIG_FATFS_SECTOR_512=y
# CONFIG_FATFS_SECTOR_4096 is not set
CONFIG_WL_SECTOR_SIZE_512=y
# CONFIG_WL_SECTOR_SIZE_4096 is not set

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
